cases/cylinder2D_multiprocessing/env03/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       2.259;

stopAt          endTime;

endTime         2.284;

deltaT          0.0005;

writeControl    runTime;

writeInterval   0.025;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;

//maxDeltaT       0.1;

libs ("libinletParabolicVelocity.so" "libjetParabolicVelocity.so" "libincrementalJetParabolicVelocity.so");
// ************************************************************************* //

functions
{
    #includeFunc  CourantNo
    #includeFunc  residuals
    #includeFunc  vorticity
    #includeFunc  forceCoeffsIncompressible
    #includeFunc  forcesIncompressible
    #includeFunc  yPlus
    #includeFunc  probes
}


